TexasInstruments/mcupsdk-core/examples/sdl/ecc/sdl_ecc_pru_scrubber/am263x/sdl_ecc_pru_scrubber_r5f0/ecc_esm_config.c
/*
 *  Copyright (C) 2026 Texas Instruments Incorporated
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <kernel/dpl/DebugP.h>
#include <kernel/dpl/ClockP.h>
#include <drivers/edma.h>
#include "ti_drivers_config.h"
#include "ti_dpl_config.h"
#include "ti_drivers_open_close.h"
#include "ti_board_open_close.h"
#include "edma_rti_sram_scrub.h"

/**
 * Defines
 */
#if defined(SOC_AM263PX)
    #define CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV4_ENABLE_SET_MASK  (0x00000080U)
    #define CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV5_ENABLE_SET_MASK  (0x00000100U)
    #define CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV4_PEND_MASK    (0x00000080U)
    #define CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV5_PEND_MASK    (0x00000100U)
#endif

/* ECC Agg SEC Enable defines */
#define APP_ECC_AGGR_SEC_ENABLE_SET_REG0_ADDR       (CSL_ECC_AGG_TOP_U_BASE + CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0)

#if defined(SOC_AM263X)
    #define APP_ECC_AGGR_SEC_ENABLE_SET_REG0_VAL        (CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV0_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV1_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV2_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV3_ENABLE_SET_MASK)
#elif defined(SOC_AM263PX)
    #define APP_ECC_AGGR_SEC_ENABLE_SET_REG0_VAL        (CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV0_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV1_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV2_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV3_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV4_ENABLE_SET_MASK | \
                                                         CSL_MSS_ECC_AGG_MSS_SEC_ENABLE_SET_REG0_MSS_L2SLV5_ENABLE_SET_MASK)
#else
#endif

/* ECC Agg SEC Status defines */
#define APP_ECC_AGGR_SEC_STATUS_REG0_ADDR           (CSL_ECC_AGG_TOP_U_BASE + CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0)

#define APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_0    (CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV0_PEND_MASK)
#define APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_1    (CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV1_PEND_MASK)
#define APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_2    (CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV2_PEND_MASK)
#define APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_3    (CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV3_PEND_MASK)
#if defined(SOC_AM263PX)
    #define APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_4    (CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV4_PEND_MASK)
    #define APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_5    (CSL_MSS_ECC_AGG_MSS_SEC_STATUS_REG0_MSS_L2SLV5_PEND_MASK)
#endif

/* ECC Agg SEC EOI defines */
#define APP_ECC_AGGR_SEC_EOI_REG_ADDR               (CSL_ECC_AGG_TOP_U_BASE + CSL_MSS_ECC_AGG_MSS_SEC_EOI_REG)
#define APP_ECC_AGGR_SEC_EOI_REG_ACK_VAL            (CSL_MSS_ECC_AGG_MSS_SEC_EOI_REG_EOI_WR_MASK)

/* ECC Agg SEC Error Status defines */
#define APP_ECC_AGGR_ERROR_STATUS1_ADDR_OFS         (CSL_MSS_ECC_AGG_MSS_ERROR_STATUS1)
#define APP_ECC_AGGR_ERROR_STATUS2_ADDR_OFS         (CSL_MSS_ECC_AGG_MSS_ERROR_STATUS2)
#define APP_ECC_AGGR_ERROR_STATUS3_ADDR_OFS         (CSL_MSS_ECC_AGG_MSS_ERROR_STATUS3)

#define APP_ECC_AGGR_ERROR_STATUS1_CLEAR_VAL        (CSL_MSS_ECC_AGG_MSS_ERROR_STATUS1_CLR_ECC_SEC_MASK | \
                                                     CSL_MSS_ECC_AGG_MSS_ERROR_STATUS1_CLR_ECC_OTHER_MASK | \
                                                     CSL_MSS_ECC_AGG_MSS_ERROR_STATUS1_CLR_PARITY_ERR_MASK | \
                                                     CSL_MSS_ECC_AGG_MSS_ERROR_STATUS1_CLR_CTRL_REG_ERR_MASK)
#define APP_ECC_AGGR_ERROR_STATUS3_CLEAR_VAL        (CSL_MSS_ECC_AGG_MSS_ERROR_STATUS3_CLR_SVBUS_TIMEOUT_ERR_MASK)

/* SRAM Banks Vector ID defines */
#define APP_SRAM_BANK_0_VECTOR_ID                          (0)
#define APP_SRAM_BANK_1_VECTOR_ID                          (1)
#define APP_SRAM_BANK_2_VECTOR_ID                          (2)
#define APP_SRAM_BANK_3_VECTOR_ID                          (3)
#if defined(SOC_AM263PX)
    #define APP_SRAM_BANK_4_VECTOR_ID                          (7)
    #define APP_SRAM_BANK_5_VECTOR_ID                          (8)
#endif

/**
 * Typedefs
 */
typedef struct {
    uint32_t eccVectorIdx;
    uint32_t eccStatusPendVal;
} App_SramBankInfo;

/**
 * Global variables declaration
 */
#if defined(SOC_AM263X)
static App_SramBankInfo gSramBanksInfo[APP_SRAM_SCRUB_NUM_BANKS] =  {
    {APP_SRAM_BANK_0_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_0},
    {APP_SRAM_BANK_1_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_1},
    {APP_SRAM_BANK_2_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_2},
    {APP_SRAM_BANK_3_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_3}
};
#elif defined(SOC_AM263PX)
static App_SramBankInfo gSramBanksInfo[APP_SRAM_SCRUB_NUM_BANKS] =  {
    {APP_SRAM_BANK_0_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_0},
    {APP_SRAM_BANK_1_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_1},
    {APP_SRAM_BANK_2_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_2},
    {APP_SRAM_BANK_3_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_3},
    {APP_SRAM_BANK_4_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_4},
    {APP_SRAM_BANK_5_VECTOR_ID, APP_ECC_AGGR_SEC_STATUS_PEND_VAL_SRAM_BANK_5}
};
#else
#endif

/**
 * Private Functions Prototype 
 */
static void App_eccAggSecEnable(void);

static inline uint32_t App_getEccVectorIdx(uint32_t bankIdx);
static inline uint32_t App_getEccStatusPendVal(uint32_t bankIdx);

/**
 * Public Functions
 */

void App_configEccEsm(void)
{
    ESM_init();

    App_eccAggSecEnable();
}

uint32_t App_getEccSecStatus(void)
{
    return HW_RD_REG32(APP_ECC_AGGR_SEC_STATUS_REG0_ADDR);
}

bool App_checkEccSecStatusPending(uint32_t bankIdx, uint32_t secStatus)
{
    uint32_t pendVal = App_getEccStatusPendVal(bankIdx);

    return ((secStatus & pendVal) == pendVal);
}

uint32_t App_getEccFaultAddr(uint32_t bankIdx)
{
    uint32_t eccVectorIdx = App_getEccVectorIdx(bankIdx);

    uint32_t eccRowAddress = ECCAGG_readRegister(eccVectorIdx, APP_ECC_AGGR_ERROR_STATUS2_ADDR_OFS);

    return (APP_SRAM_SCRUB_START_ADDR + (bankIdx * APP_SRAM_SCRUB_BANK_SIZE_BYTES) + (eccRowAddress * APP_SRAM_SCRUB_ECC_ROW_WIDTH_BYTES));
}

void App_clearEccFault(uint32_t bankIdx)
{
    uint32_t eccVectorIdx = App_getEccVectorIdx(bankIdx);

    uint32_t status1 = ECCAGG_readRegister(eccVectorIdx, APP_ECC_AGGR_ERROR_STATUS1_ADDR_OFS);
    uint32_t status3 = ECCAGG_readRegister(eccVectorIdx, APP_ECC_AGGR_ERROR_STATUS3_ADDR_OFS);

    ECCAGG_writeRegister(eccVectorIdx, APP_ECC_AGGR_ERROR_STATUS1_ADDR_OFS, status1 | APP_ECC_AGGR_ERROR_STATUS1_CLEAR_VAL);
    ECCAGG_writeRegister(eccVectorIdx, APP_ECC_AGGR_ERROR_STATUS3_ADDR_OFS, status3 | APP_ECC_AGGR_ERROR_STATUS3_CLEAR_VAL);

    /* Acknowledge in EOI register */
    HW_WR_REG32(APP_ECC_AGGR_SEC_EOI_REG_ADDR, APP_ECC_AGGR_SEC_EOI_REG_ACK_VAL);
}

/**
 * Private Functions
 */

static void App_eccAggSecEnable(void)
{
    HW_WR_REG32(APP_ECC_AGGR_SEC_ENABLE_SET_REG0_ADDR, APP_ECC_AGGR_SEC_ENABLE_SET_REG0_VAL);
}

static inline uint32_t App_getEccVectorIdx(uint32_t bankIdx)
{
    return gSramBanksInfo[bankIdx].eccVectorIdx;
}

static inline uint32_t App_getEccStatusPendVal(uint32_t bankIdx)
{
    return gSramBanksInfo[bankIdx].eccStatusPendVal;
}
